# Introduction

This a study on time series using statsmodels and prophet.

Guided through a series of videos you can find on [TÃ©o Calvo YouTube Channel](https://www.youtube.com/@teomewhy)

In [3]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib

matplotlib.rcParams['figure.figsize'] = [16,4]
pd.set_option('display.max_columns', 100)

In [4]:
df = pd.read_csv('../data/dfTimeSeries_Example1.csv')

In [5]:
df.head()

,dept_id,state_id,cat_id,d,date,event_name_1,event_type_1,value_sales,sell_price
0,FOODS_1,CA,FOODS,d_1,2011-01-29,NaN,NaN,297,2.989109
1,FOODS_1,CA,FOODS,d_10,2011-02-07,NaN,NaN,176,3.016636
2,FOODS_1,CA,FOODS,d_100,2011-05-08,Mother's day,Cultural,211,2.987851
3,FOODS_1,CA,FOODS,d_1000,2013-10-24,NaN,NaN,243,3.237990
4,FOODS_1,CA,FOODS,d_1001,2013-10-25,NaN,NaN,331,3.237990